[
  "One morning a carpenter was sawing a log of wood under a tree. He was wearing a bright blue shirt. The carpenter wanted to cut the log into two parts.",
  "Frank Edward McGurrin, a court stenographer from Salt Lake City, Utah who taught typing classes, reportedly invented touch typing in 1888. On a standard keyboard for English speakers the home row keys are: 'ASDF' for the left hand and 'JKL;' for the right hand. The keyboard is called a QWERTY keyboard because these are the first six letters on the keyboard. Most modern computer keyboards have a raised dot or bar on the home keys for the index fingers to help touch typists maintain and rediscover the correct position on the keyboard quickly with no need to look at the keys. More recently, the ability to touch type on touchscreen phones has been made possible with the use of specialized virtual keyboard software for touch typing.",
  "A late 20th century trend in typing, primarily used with devices with small keyboards (such as PDAs and Smartphones), is thumbing or thumb typing. This can be accomplished using one or both thumbs. Similar to desktop keyboards and input devices, if a user overuses keys which need hard presses and/or have small and unergonomic layouts, it could cause thumb tendonitis or other repetitive strain injury. (Wikipedia)",
  "Being human makes us susceptible to the onset of feelings. The role of these emotions varies. Some of them are useful while others may be harmful. The use of social media for self-expression has reached a point that it makes us feel we can say anything. This begins when we see people expressing anything and everything that come to mind. When we see everyone else voicing their likes and dislikes, their irritations and desires we tend to imitate what they do. And because many engage in this, we think that it is normal and healthy. However, when we get used to unbridled self-expression, we come to believe that all feelings are valid. We become convinced that in real life, we should also act on our emotions and our impulses. Using social media this way erodes our ability to regulate our actions and reactions. To illustrate, when something small irritates us we think that it's okay to feel this way.",
  "An ever-growing number of complex and rigid rules plus hard-to-cope-with regulations are now being legislated from state to state. Key federal regulations were formulated by the FDA, FTC, and the CPSC. Each of these federal agencies serves a specific mission. One example: Laws sponsored by the Office of the Fair Debt Collection Practices prevent an agency from purposefully harassing clients in serious debt. The Fair Packaging and Labeling Act makes certain that protection from misleading packaging of goods is guaranteed to each buyer of goods carried in small shops as well as in large supermarkets.",
  "Once upon a time there was honest shoemaker, who was very poor. He worked as hard as he could, and still he could not earn enough to keep himself and his wife. At last there came a day when he had nothing left but one piece of leather, big enough to make one pair of shoes. He cut out the shoes, ready to stitch, and left them on the bench.",
  "The fish are just 120 microns long and 30 microns thick, much smaller than a human hair. Researchers can 3D print hundreds of the fish in seconds. The fish are printed with tiny particles of platinum in the tail which react with hydrogen peroxide. When the microfish are placed in peroxide, the tails move, propelling the fish along. The scientists can also add other particles to the materials used to print the fish, including chemicals that can detect and absorb toxins like bee venom. In the study, they showed that the microfish could detoxify a liquid contaminated with a toxin. As the fish work, they glow red, and the swimming motion helps make sure they don't miss a drop of the contaminant.\n\nThese fish are just a proof of concept. They won't be used outside of a lab for a long time yet, but their creators have very high hopes for the fish.",
  "Whether or not you believe in God, you must believe this: when we as a species abandon our trust in a power greater than us, we abandon our sense of accountability. Faiths, all faiths... are admonitions that there is something we cannot understand, something to which we are accountable. With faith we are accountable to each other, to ourselves, and to a higher truth. Religion is flawed, but only because man is flawed. The church consists of a brotherhood of imperfect, simple souls wanting only to be a voice of compassion in a world spinning out of control.\n\nThe first major grouping of Shakespeare plays begins with his histories and comedies of the 1590s. Shakespeare's earliest plays tended to be adaptations of other playwright's works and employed blank verse and little variation in rhythm.",
  "PICT IEEE Student Branch (PISB), one of the most active student Branches of IEEE, is the proud host of the annual technical event Credenz. It is one of the most innovative and scientific events held in August every year. It is organised exclusively by students of PISB. It has grown manifold since its inception in 2004, and has made a name for itself as a Technical Renaissance showcasing the young emerging minds of technocrats and administrators. Through its deluge of competitions, lectures, exhibitions and workshops, Credenz endeavors to enkindle the minds of thousands of students visiting annually. Over the years, it has attracted the connoisseurs of Engineering and Technology.Credenz represents zenith of science and engineering in a landscape of future visionaries and scientists. From thrilling robotic competitions to the enriching workshops, every bit promises to be a fulfilling experience.",
  "The ability to understand natural language queries is a big deal. You can ask, for example: I'm going to be in Boston. I like basketball. What do you suggest, Watson?\" You might get several answers: Celtics tickets, Boston College tickets, Harvard tickets. Or in the offseason, Watson may suggest you drive to the Basketball Hall of Fame in Springfield (MA). Companies are already using Watson this way. Fluid, Inc.'s Watson-based retail solutions deliver granular results to queries such as \"I am taking my wife and three children camping in upstate New York in October and I need a tent.\"\n\nConsider this : Watson has been taught to pass the medical boards. Would you trust it to diagnose you and prescribe medication? What if you claim to be in pain and Watson doesn't believe your subjective input?",
  "Apple's secretive project aimed at testing self-driving cars seems worlds apart from the tech giant's usual business of smartphones and tablets. But the idea of a robotic \"iCar\" raises an intriguing possibility: What if self-driving cars were represented by virtual assistants similar to Apple's Siri for the iPhone and iPad?\n\nA version of Siri for self-driving cars might even adopt a familiar virtual face on a display screen to win the trust of potential human owners. Getting people to trust in a future world filled with self-driving cars could go a long way toward making commutes both safer and faster.\n\nThe promise of robot cars has driven both traditional automakers and tech giants such as Google and China's Baidu to develop their own versions of the technology.",
  "Bob acted as virtual driver while study participants sat in a driving simulator. Half of the participants got to ride along with a Bob who resembled them, whereas the other half of the participants got a Bob with a dissimilar face. The familiar Bob also behaved in two additional ways calculated to help increase trust. First, he mimicked the head movements of participants, with a four-second delay to avoid any creepiness.\n\nSecond, Bob displayed the same driving goals as the study participant on a computer screen. Participants were asked to rank their goals in terms of comfort, energy efficiency and speed. In the end, participants rated the familiar Bob as more trustworthy than the dissimilar Bob during driving scenarios leading up to road obstacles such as shallow or sharp turns, a traffic jam, a red traffic light or a fallen tree on the road.",
  "One limitation of the study came from the fact that the driving scenarios all stopped just before the critical moment of dealing with the road obstacle.It's possible that dissimilar Bob could have won an equivalent level of trust as familiar Bob if he had shown participants that he could successfully navigate such obstacles. But in this case, Verberne and his colleagues intentionally chose to stop short so that they could focus on measuring levels of trust in the midst of uncertainty.\n\nThe three types of similarity in the familiar Bob-face, head movement and shared driving goals-did not seem to add up to more overall trust compared with previous studies that tested just one type of similarity. But having a virtual driving assistant with as many similarities as possible might appeal to different self driving car owners who subconsciously value one type of similarity over the other.",
  "Such research represents just a first step toward understanding how a virtual driver might make self-driving cars appear more friendly. For example, the study did not directly test whether having a self-driving car represented by a virtual assistant increases human trust compared with a silent, faceless robot car. It's also possible that just having a faceless virtual driver with a likeable voice and winning personality might also do the trick.\n\nA virtual driving assistant with both a friendly face and voice might seem like the obvious end goal. But researchers may still have to tread carefully in finding the right combination. In a past study, Verberne discovered that combining an artificial-sounding voice with a face similar to the human owner could actually creep people out.",
  "Apple's upcoming media event has been expected to take place on September 9 for quite some time. It's exactly the same date that Apple held their fall event in 2014 as well, when the iPhone 6 and Apple Watch was announced. Many experts believe that Force Touch-a new feature that allows touchpads and touchscreens to determine how much pressure is applied to their surface-will be added to the iPhone 6s.\n\nForce Touch is already available in the Apple Watch, and it was added to the newest Macbook earlier this year at WWDC. In addition to new hardware, many expect iOS 9 to be rolled out to existing iPhone 6 handsets and any new ones that are announced. Other changes that are expected include a better camera, faster processor, and thicker design to prevent bending.",
  "The internet is flooded with photos-of your brunch, of your cat, of your estranged elementary school friend's cousin's wedding. 1.8 billion photos are uploaded daily, and most of them are objectively pretty terrible. Now a team of computer scientists from Princeton University and software company Adobe have created a program to make those photos just a little better, by identifying and eliminating distracting elements, according to a paper presented recently at this year's Computer Vision and Pattern Recognition Conference in Boston.\n\nThere are lots of elements of a \"casual\" photo that can make it terrible-bad lighting, off-angles. But one that's often ignored is the inclusion of distracting elements, objects in the photo that distract the viewer's attention from the image's main focus.",
  "Instagram now supports portrait and landscape photos in its app, meaning you'll start seeing more rectangular photos in your feed. Taking photos within the app will continue to default to square-shaped pictures, but photos imported from other apps will preserve their look. Instead of the letterbox view, the Instagram photo feed will adjust in size accordingly.\n\n\"It turns out that nearly one in five photos or videos people post aren't in the square format,\" said Instagram in a statement. \"Now, when choosing a photo or video, you can tap the format icon to adjust the orientation to portrait or landscape instead of square",
  "Wuthering Heights is the name of Mr. Heathcliff's dwelling. 'Wuthering' being a significant provincial adjective, descriptive of the atmospheric tumult to which its station is exposed in stormy weather. Pure, bracing ventilation they must have up there at all times, indeed: one may guess the power of the north wind blowing over the edge, by the excessive slant of a few stunted firs at the end of the house; and by a range of gaunt thorns all stretching their limbs one way, as if craving alms of the sun. Happily, the architect had foresight to build it strong: the narrow windows are deeply set in the wall, and the corners defended with large jutting stones. ('Wuthering Heights' by Emily Bronte)",
  "Each picture told a story; mysterious often to my undeveloped understanding and imperfect feelings, yet ever profoundly interesting: as interesting as the tales Bessie sometimes narrated on winter evenings, when she chanced to be in good humour; and when, having brought her ironing-table to the nursery hearth, she allowed us to sit about it, and while she got up Mrs. Reed's lace frills, and crimped her nightcap borders, fed our eager attention with passages of love and adventure taken from old fairy tales and other ballads; or (as at a later period I discovered) from the pages of Pamela, and Henry, Earl of Moreland. ('Jane Eyre' by Charlotte Bronte)",
  "Merciful Heavens! but what do I care for the laws of nature and arithmetic, when, for some reason I dislike those laws and the fact that twice two makes four? Of course I cannot break through the wall by battering my head against it if I really have not the strength to knock it down, but I am not going to be reconciled to it simply because it is a stone wall and I have not the strength. ('Notes from the Underground' by Fyodor Dostoyevsky)",
  "It was a feature peculiar to the colonial wars of North America, that the toils and dangers of the wilderness were to be encountered before the adverse hosts could meet. A wide and apparently an impervious boundary of forests severed the possessions of the hostile provinces of France and England. The hardy colonist, and the trained European who fought at his side, frequently expended months in struggling against the rapids of the streams, or in effecting the rugged passes of the mountains, in quest of an opportunity to exhibit their courage in a more martial conflict. But, emulating the patience and self-denial of the practiced native warriors, they learned to overcome every difficulty; and it would seem that, in time, there was no recess of the woods so dark, nor any secret place so lovely, that it might claim exemption from the inroads of those who had pledged their blood to satiate their vengeance, or to uphold the cold and selfish policy of the distant monarchs of Europe. ('The Last of the Mohicans' by James Fenimore Cooper)",
  "Then rode Merlin unto Arthur and the two kings, and told them how he had sped; whereof they had great marvel, that man on earth might speed so soon, and go and come. So Merlin told them ten thousand were in the forest of Bedegraine, well armed at all points. Then was there no more to say, but to horseback went all the host as Arthur had afore purveyed. So with twenty thousand he passed by night and day, but there was made such an ordinance afore by Merlin, that there should no man of war ride nor go in no country on this side Trent water, but if he had a token from King Arthur, where through the king's enemies durst not ride as they did to-fore to espy. ('Le Morte D'Arthur' by Thomas Malory)",
  "All states, all powers, that have held and hold rule over men have been and are either republics or principalities. Principalities are either hereditary, in which the family has been long established; or they are new. The new are either entirely new, as was Milan to Francesco Sforza, or they are, as it were, members annexed to the hereditary state of the prince who has acquired them, as was the kingdom of Naples to that of the King of Spain. Such dominions thus acquired are either accustomed to live under a prince, or to live in freedom; and are acquired either by the arms of the prince himself, or of others, or else by fortune or by ability. ('The Prince' by Nicolo Machiavelli)",
  "Buck lived at a big house in the sun-kissed Santa Clara Valley. Judge Miller's place, it was called. It stood back from the road, half hidden among the trees, through which glimpses could be caught of the wide cool veranda that ran around its four sides. The house was approached by gravelled driveways which wound about through wide-spreading lawns and under the interlacing boughs of tall poplars. At the rear things were on even a more spacious scale than at the front. There were great stables, where a dozen grooms and boys held forth, rows of vine-clad servants' cottages, an endless and orderly array of outhouses, long grape arbors, green pastures, orchards, and berry patches. Then there was the pumping plant for the artesian well, and the big cement tank where Judge Miller's boys took their morning plunge and kept cool in the hot afternoon. ('The Call of the Wild' by Jack London)",
  "You can easily imagine what a father such a man could be and how he would bring up his children. His behavior as a father was exactly what might be expected. He completely abandoned the child of his marriage with Adelaida Ivanovna, not from malice, nor because of his matrimonial grievances, but simply because he forgot him. While he was wearying every one with his tears and complaints, and turning his house into a sink of debauchery, a faithful servant of the family, Grigory, took the three‐year‐old Mitya into his care. If he hadn't looked after him there would have been no one even to change the baby's little shirt. ('The Brothers Karamazov' by Fyodor Dostoyevsky)",
  "In the centre of the room, clamped to an upright easel, stood the full-length portrait of a young man of extraordinary personal beauty, and in front of it, some little distance away, was sitting the artist himself, Basil Hallward, whose sudden disappearance some years ago caused, at the time, such public excitement and gave rise to so many strange conjectures. ('The Picture of Dorian Gray' by Oscar Wilde)",
  "When I waked it was broad day, the weather clear, and the storm abated, so that the sea did not rage and swell as before. But that which surprised me most was, that the ship was lifted off in the night from the sand where she lay by the swelling of the tide, and was driven up almost as far as the rock which I at first mentioned, where I had been so bruised by the wave dashing me against it. This being within about a mile from the shore where I was, and the ship seeming to stand upright still, I wished myself on board, that at least I might save some necessary things for my use. When I came down from my apartment in the tree, I looked about me again, and the first thing I found was the boat, which lay, as the wind and the sea had tossed her up, upon the land, about two miles on my right hand. I walked as far as I could upon the shore to have got to her; but found a neck or inlet of water between me and the boat which was about half a mile broad; so I came back for the present, being more intent upon getting at the ship, where I hoped to find something for my present subsistence. ('The Life and Adventures of Robinson Crusoe' by Daniel Defoe)",
  "A big greyish rounded bulk, the size, perhaps, of a bear, was rising slowly and painfully out of the cylinder. As it bulged up and caught the light, it glistened like wet leather. ('The War of the Worlds' by H. G. Wells)",
  "He turned round to the fire, gave a kick to a log, watched it an instant. Then as he faced us again: 'I can't begin. I shall have to send to town.' There was a unanimous groan at this, and much reproach; after which, in his preoccupied way, he explained. 'The story's written. It's in a locked drawer--it has not been out for years. I could write to my man and enclose the key; he could send down the packet as he finds it.' It was to me in particular that he appeared to propound this--appeared almost to appeal for aid not to hesitate. He had broken a thickness of ice, the formation of many a winter; had had his reasons for a long silence. The others resented postponement, but it was just his scruples that charmed me. I adjured him to write by the first post and to agree with us for an early hearing; then I asked him if the experience in question had been his own. To this his answer was prompt. 'Oh, thank God, no!' ('The Turn of the Screw' by Henry James)",
  "Then rode Merlin unto Arthur and the two kings, and told them how he had sped; whereof they had great marvel, that man on earth might speed so soon, and go and come. So Merlin told them ten thousand were in the forest of Bedegraine, well armed at all points. Then was there no more to say, but to horseback went all the host as Arthur had afore purveyed. So with twenty thousand he passed by night and day, but there was made such an ordinance afore by Merlin, that there should no man of war ride nor go in no country on this side Trent water, but if he had a token from King Arthur, where through the king's enemies durst not ride as they did to-fore to espy. ('Le Morte D'Arthur' by Thomas Malory)",
  "To Sherlock Holmes she is always THE woman. I have seldom heard him mention her under any other name. In his eyes she eclipses and predominates the whole of her sex. It was not that he felt any emotion akin to love for Irene Adler. All emotions, and that one particularly, were abhorrent to his cold, precise but admirably balanced mind. He was, I take it, the most perfect reasoning and observing machine that the world has seen, but as a lover he would have placed himself in a false position. He never spoke of the softer passions, save with a gibe and a sneer. They were admirable things for the observer--excellent for drawing the veil from men's motives and actions. But for the trained reasoner to admit such intrusions into his own delicate and finely adjusted temperament was to introduce a distracting factor which might throw a doubt upon all his mental results. Grit in a sensitive instrument, or a crack in one of his own high-power lenses, would not be more disturbing than a strong emotion in a nature such as his. And yet there was but one woman to him, and that woman was the late Irene Adler, of dubious and questionable memory. ('The Adventures of Sherlock Holmes' by Sir Arthur Conan Doyle)",
  "A big greyish rounded bulk, the size, perhaps, of a bear, was rising slowly and painfully out of the cylinder. As it bulged up and caught the light, it glistened like wet leather. ('The War of the Worlds' by H. G. Wells)",
  "Call me Ishmael. Some years ago - never mind how long precisely - having little or no money in my purse, and nothing particular to interest me on shore, I thought I would sail about a little and see the watery part of the world. It is a way I have of driving off the spleen and regulating the circulation. Whenever I find myself growing grim about the mouth; whenever it is a damp, drizzly November in my soul; whenever I find myself involuntarily pausing before coffin warehouses, and bringing up the rear of every funeral I meet; and especially whenever my hypos get such an upper hand of me, that it requires a strong moral principle to prevent me from deliberately stepping into the street, and methodically knocking people's hats off - then, I account it high time to get to sea as soon as I can. This is my substitute for pistol and ball. With a philosophical flourish Cato throws himself upon his sword; I quietly take to the ship. There is nothing surprising in this. If they but knew it, almost all men in their degree, some time or other, cherish very nearly the same feelings towards the ocean with me. ('Moby Dick' by Herman Melville)",
  "In the evening, at preparation, he pulled out his pens from his desk, arranged his small belongings, and carefully ruled his paper. We saw him working conscientiously, looking up every word in the dictionary, and taking the greatest pains. Thanks, no doubt, to the willingness he showed, he had not to go down to the class below. But though he knew his rules passably, he had little finish in composition. It was the cure of his village who had taught him his first Latin; his parents, from motives of economy, having sent him to school as late as possible. ('Madame Bovary' by Gustave Flaubert)",
  "He turned round to the fire, gave a kick to a log, watched it an instant. Then as he faced us again: 'I can't begin. I shall have to send to town.' There was a unanimous groan at this, and much reproach; after which, in his preoccupied way, he explained. 'The story's written. It's in a locked drawer--it has not been out for years. I could write to my man and enclose the key; he could send down the packet as he finds it.' It was to me in particular that he appeared to propound this--appeared almost to appeal for aid not to hesitate. He had broken a thickness of ice, the formation of many a winter; had had his reasons for a long silence. The others resented postponement, but it was just his scruples that charmed me. I adjured him to write by the first post and to agree with us for an early hearing; then I asked him if the experience in question had been his own. To this his answer was prompt. 'Oh, thank God, no!' ('The Turn of the Screw' by Henry James)",
  "I do therefore humbly offer it to publick consideration, that of the hundred and twenty thousand children, already computed, twenty thousand may be reserved for breed, whereof only one fourth part to be males; which is more than we allow to sheep, black cattle, or swine, and my reason is, that these children are seldom the fruits of marriage, a circumstance not much regarded by our savages, therefore, one male will be sufficient to serve four females. That the remaining hundred thousand may, at a year old, be offered in sale to the persons of quality and fortune, through the kingdom, always advising the mother to let them suck plentifully in the last month, so as to render them plump, and fat for a good table. A child will make two dishes at an entertainment for friends, and when the family dines alone, the fore or hind quarter will make a reasonable dish, and seasoned with a little pepper or salt, will be very good boiled on the fourth day, especially in winter. ('A Modest Proposal' by Jonathan Swift)",
  "Thou likenest a woman's love to hell; To barren land where water may not dwell. Thou likenest it also to wild fire; The more it burns, the more it hath desire To consume every thing that burnt will be. Thou sayest, right as wormes shend a tree, Right so a wife destroyeth her husbond; This know they well that be to wives bond.' ('The Canterbury Tales' by Geoffrey Chaucer)"
]